import matplotlib.pyplot as plt

# данные для построения графика
x1 = [1, 2, 3, 4, 5, 6, 7, 8]
y1 = [1, 0.87, 1.38, 1.5, 1.62, 1.65, 1.66, 1.66]
x2 = [1, 2, 3, 4, 5, 6, 7, 8]
y2 = [1, 2.06, 2.92, 3.89, 4.75, 5.57, 6.3, 7.11]
x3 = [1, 2, 3, 4, 5, 6, 7, 8]
y3 = [1, 2.006, 3.009, 4.01, 5.07, 6.2, 7.05, 8.1]

# создание графика
plt.plot(x1, y1, c='red')
plt.plot(x2, y2, c='blue')
plt.plot(x3, y3, c='green')

# настройка внешнего вида графика
plt.title('MPI')
plt.xlabel('Количество процессов')
plt.ylabel('Ускорение')
plt.legend(['N = 1000', 'N = 10^6', 'N = 10^8'])
plt.xticks(range(1, 8, 1))
plt.yticks(range(0, 9, 1))

# отображение графика
plt.show()
